alp = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя ,.!?:1234567890-—;/()[]<>\'"' # для большого текста
HEX = '0123456789abcdef'
# это наши s блоки 8 штук взял из ГОСТ 34.12-2015
# s_blocks = [
# 	[1,  7,  14, 13, 0,  5,  8,  3,  4,  15, 10, 6,  9,  12, 11, 2],
# 	[8, 14, 2, 5, 6, 9, 1, 12, 15, 4, 11, 0, 13, 10, 3, 7],
# 	[5, 13, 15, 6, 9, 2, 12, 10, 11, 7, 8, 1, 4, 3, 14, 0],
# 	[7,  15, 5,  10, 8,  1,  6,  13, 0,  9,  3,  14, 11, 4,  2,  12],
# 	[12, 8,  2,  1,  13, 4,  15, 6,  7,  0,  10, 5,  3,  14, 9,  11],
# 	[11, 3,  5,  8,  2,  15, 10, 13, 14, 1,  7,  4,  12, 9,  6,  0],
# 	[6,  8,  2,  3,  9,  10, 5,  12, 1,  14, 4,  7,  11, 13, 0,  15],
# 	[12, 4,  6,  2,  10, 5,  11, 9,  14, 8,  13, 7,  0,  3,  15, 1]
# 	]

pi0 = [12, 4, 6, 2, 10, 5, 11, 9, 14, 8, 13, 7, 0, 3, 15, 1]
pi1 = [6, 8, 2, 3, 9, 10, 5, 12, 1, 14, 4, 7, 11, 13, 0, 15]
pi2 = [11, 3, 5, 8, 2, 15, 10, 13, 14, 1, 7, 4, 12, 9, 6, 0]
pi3 = [12, 8, 2, 1, 13, 4, 15, 6, 7, 0, 10, 5, 3, 14, 9, 11]
pi4 = [7, 15, 5, 10, 8, 1, 6, 13, 0, 9, 3, 14, 11, 4, 2, 12]
pi5 = [5, 13, 15, 6, 9, 2, 12, 10, 11, 7, 8, 1, 4, 3, 14, 0]
pi6 = [8, 14, 2, 5, 6, 9, 1, 12, 15, 4, 11, 0, 13, 10, 3, 7]
pi7 = [1, 7, 14, 13, 0, 5, 8, 3, 4, 15, 10, 6, 9, 12, 11, 2]

pi = [pi0, pi1, pi2, pi3, pi4, pi5, pi6, pi7]
# s блок шифрование
def s_block_encrypt(inp):
	out_hex = 0
	for i in reversed(range(8)):
		j = (inp >> 4 * i) & 0xf#Сдвиг битов на 4
		print(F"j= {j}")
		out_hex <<= 4
		print(out_hex)
		out_hex ^= pi[i][j]
		print(out_hex)
	return hex(out_hex)

def s_block_decrypt(inp):
	out_hex = 0
	for i in reversed(range(8)):
		j = (inp>>4*i) & 0xf  # Сдвиг битов на 4
		print(F"j= {j}")
		out_hex <<= 4
		out_hex ^= pi[i][j]
	return hex(out_hex)


	# подставление индексов в s блоки и получение результата 4 буквы
# s блок расшифрование
hex_alph={'а': '0', 'б': '1', 'в': '2', 'г': '3',
		  'д': '4', 'е': '5', 'ё': '6', 'ж': '7',
		  'з': '8', 'и': '9', 'й': 'A', 'к': 'B',
		  'л': 'C', 'м': 'D', 'н': 'E', 'о': 'F',
		  'п': '10', 'р': '11', 'с': '12', 'т': '13',
		  'у': '14', 'ф': '15', 'х': '16', 'ц': '17',
		  'ч': '18', 'ш': '19', 'щ': '1A', 'ъ': '1B',
		  'ы': '1C', 'ь': '1D', 'э': '1E', 'ю': '1F', 'я': '20'}
# def encrypt(hextext):
# 	block_size=4
# 	out_data=""
# 	for i in range(block_size):
# 		out_data+=S

test= int("fdb97531",16)
result = s_block_encrypt(test)
print("Проверка на тесте: " + result)
test=int("2a196f34",16)
result = s_block_decrypt(test)
print("Проверка на тесте: " + result)
# text=input("Введите текст: ")
# ciprtext=
# print("Расшифрованный текст: " + decrypt(result))
