letters = {"А": "11", "Б": "12", "В": "13", "Г": "14", "Д": "15", "Е": "16", "Ё": "21",
           "Ж": "22", "З": "23", "И": "24", "Й": "25", "К": "26", "Л": "31", "М": "32",
           "Н": "33", "О": "34", "П": "35", "Р": "36", "С": "41", "Т": "42", "У": "43",
           "Ф": "44", "Х": "45", "Ц": "46", "Ч": "51", "Ш": "52", "Щ": "53", "Ъ": "54",
           "Ы": "55", "Ь": "56", "Э": "61", "Ю": "62", "Я": "63",
           "а": "64", "б": "65", "в": "66", "г": "67", "д": "68", "е": "69", "ё": "70",
           "ж": "71", "з": "72", "и": "73", "й": "74", "к": "75", "л": "76", "м": "77",
           "н": "78", "о": "79", "п": "80", "р": "81", "с": "82", "т": "83", "у": "84",
           "ф": "85", "х": "86", "ц": "87", "ч": "88", "ш": "89", "щ": "90", "ъ": "91",
           "ы": "92", "ь": "93", "э": "94", "ю": "95", "я": "96", "!": "97", "@": "98",
            ".": "99", ",": "100", "%": "101", "^": "102", "&": "103", "*": "104",
             "(": "105", ")": "106", "-": "107", "_": "108", "=": "109", "+": "110",
           " ": "111", "]": "112", "{": "113", "}": "114"}


alp = {"А": "11", "Б": "12", "В": "13", "Г": "14", "Д": "15", "Е": "16",
           "Ж": "21", "З": "22", "И": "23", "Й": "24", "К": "25", "Л": "26", "М": "31",
           "Н": "32", "О": "33", "П": "34", "Р": "35", "С": "36", "Т": "41", "У": "42",
           "Ф": "43", "Х": "44", "Ц": "45", "Ч": "46", "Ш": "51", "Щ": "52", "Ъ": "53",
           "Ы": "54", "Ь": "55", "Э": "56", "Ю": "61", "Я": "62"}

def encrypt(text, task):
    res = []
    if task == 2:
        for x in text:
            res.append(letters.get(x))
    elif task == 1:
        for x in text:
            res.append(alp.get(x))
            
    return res

def decrypt(text, task):
    res = ""
    if task == 2:
        for i in text:
            for key, val in letters.items():
                if val == i:
                    res += key
    elif task == 1:
        for i in text:
            for key, val in alp.items():
                if val == i:
                    res += key
    return res

text = input("Введите фразу: ")
task = int(input("Выберите режим работы (1 - карточка, 2 - текст > 1000 cимволов): "))
result = encrypt(text, task)
print("Зашифрованный текст: " + ''.join(result))

print("Текст для расшифровки : " + ''.join(result))
print("Результат : " + decrypt(result, task))
