letters = {"А": "11", "Б": "12", "В": "13", "Г": "14", "Д": "15", "Е": "16", "Ё": "21",
           "Ж": "22", "З": "23", "И": "24", "Й": "25", "К": "26", "Л": "31", "М": "32",
           "Н": "33", "О": "34", "П": "35", "Р": "36", "С": "41", "Т": "42", "У": "43",
           "Ф": "44", "Х": "45", "Ц": "46", "Ч": "51", "Ш": "52", "Щ": "53", "Ъ": "54",
           "Ы": "55", "Ь": "56", "Э": "61", "Ю": "62", "Я": "63",
           "а": "64", "б": "65", "в": "66", "г": "67", "д": "68", "е": "69", "ё": "70",
           "ж": "71", "з": "72", "и": "73", "й": "74", "к": "75", "л": "76", "м": "77",
           "н": "78", "о": "79", "п": "80", "р": "81", "с": "82", "т": "83", "у": "84",
           "ф": "85", "х": "86", "ц": "87", "ч": "88", "ш": "89", "щ": "90", "ъ": "91",
           "ы": "92", "ь": "93", "э": "94", "ю": "95", "я": "96"}

symbols = {"!": "97", "@": "98", ".": "99", ",": "100", "%": "101", "^": "102", "&": "103",
           "*": "104", "(": "105", ")": "106", "-": "107", "_": "108", "=": "109", "+": "110",
           " ": "111", "]": "112", "{": "113", "}": "114"}

def encrypt(text):
    res = []
    for x in text:
        if x in letters:
            res.append(letters.get(x))
        elif x in symbols:
            res.append(symbols.get(x))
    return res

def decrypt(text):
    res = ""
    for i in text:
        for key, val in letters.items():
            if val == i:
                res += key
        for key, val in symbols.items():
            if val == i:
                res += key
    return res

text = input("Введите фразу: ")
result = encrypt(text)
print("Зашифрованный текст: " + ''.join(result))

print("Текст для расшифровки : " + ''.join(result))
print("Результат : " + decrypt(result))
